OlegDemk/stm32F103C8_NRF24L01_and_LoRa_E220_900T22D/RX/Core/Src/menu/menu.c
	items[1].up = &items[0];
	items[1].down = &items[2];
	items[1].child = &items_menu_2[0];
	items[1].parent = 0;
	items[1].id = 2;
	items[1].name = "NRF24L01";
	items[1].updateScreen_up = p_print_rows_on_oled_if_up;
	items[1].updateScreen_down = p_print_rows_on_oled_if_down;
	items[1].makeAction = 0;

	items[2].up = &items[1];
	items[2].down = 0;
	items[2].child = &items_menu_3[0];
	items[2].parent = 0;
	items[2].id = 3;
	items[2].name = "AM2302 sensor";
	items[2].updateScreen_up = p_print_rows_on_oled_if_up;
	items[2].updateScreen_down = p_print_rows_on_oled_if_down;
	items[2].makeAction = 0;

	///////////////////////////////////////////////////////////////////
	// Creating LoRa menu
	items_menu_1[0].up = 0;
	items_menu_1[0].down = &items_menu_1[1];
	items_menu_1[0].id = 1;
	items_menu_1[0].child = 0;
	items_menu_1[0].parent = &items[0];
	items_menu_1[0].name = "LoRa RX";
	items_menu_1[0].updateScreen_up = p_print_rows_on_oled_if_up;
	items_menu_1[0].updateScreen_down = p_print_rows_on_oled_if_down;
	items_menu_1[0].makeAction = p_lora_rx_mode;

	items_menu_1[1].up = &items_menu_1[0];
	items_menu_1[1].down = &items_menu_1[2];
	items_menu_1[1].child = 0;
	items_menu_1[1].parent = &items[0];
	items_menu_1[1].id = 2;
	items_menu_1[1].name = "LoRa TX";
	items_menu_1[1].updateScreen_up = p_print_rows_on_oled_if_up;
	items_menu_1[1].updateScreen_down = p_print_rows_on_oled_if_down;
	items_menu_1[1].makeAction = p_lora_tx_mode;

	items_menu_1[2].up = &items_menu_1[1];
	items_menu_1[2].down = 0;
	items_menu_1[2].child = 0;
	items_menu_1[2].parent = &items[0];
	items_menu_1[2].id = 3;
	items_menu_1[2].name = "EXIT";						// Name of item
	items_menu_1[2].updateScreen_up = p_print_rows_on_oled_if_up;
	items_menu_1[2].updateScreen_down = p_print_rows_on_oled_if_down;
	items_menu_1[2].makeAction = p_return_from_menu;

	///////////////////////////////////////////////////////////////////
	// Creating NRF menu
	items_menu_2[0].up = 0;
	items_menu_2[0].down = &items_menu_2[1];
	items_menu_2[0].child = 0;
	items_menu_2[0].parent = &items[1];
	items_menu_2[0].id = 1;
	items_menu_2[0].name = "NRF RX";						// Name of item
	items_menu_2[0].updateScreen_up = p_print_rows_on_oled_if_up;
	items_menu_2[0].updateScreen_down = p_print_rows_on_oled_if_down;
	items_menu_2[0].makeAction = p_nrf_rx_mode;

	items_menu_2[1].up = &items_menu_2[0];
	items_menu_2[1].down = &items_menu_2[2];
	items_menu_2[1].child = 0;
	items_menu_2[1].parent = &items[1];
	items_menu_2[1].id = 2;
	items_menu_2[1].name = "NRF TX";						// Name of item
	items_menu_2[1].updateScreen_up = p_print_rows_on_oled_if_up;
	items_menu_2[1].updateScreen_down = p_print_rows_on_oled_if_down;
	items_menu_2[1].makeAction = p_nrf_tx_mode;

	items_menu_2[2].up = &items_menu_2[1];
	items_menu_2[2].down = 0;
	items_menu_2[2].child = 0;
	items_menu_2[2].parent = &items[1];
	items_menu_2[2].id = 3;
	items_menu_2[2].name = "EXIT";						// Name of item
	items_menu_2[2].updateScreen_up = p_print_rows_on_oled_if_up;
	items_menu_2[2].updateScreen_down = p_print_rows_on_oled_if_down;
	items_menu_2[2].makeAction = p_return_from_menu;

	///////////////////////////////////////////////////////////////////
	// Creating sensor menu
	items_menu_3[0].up = 0;
	items_menu_3[0].down = &items_menu_3[1];
	items_menu_3[0].child = 0;
	items_menu_3[0].parent = &items[2];
	items_menu_3[0].id = 1;
	items_menu_3[0].name = "Measure T & H";						// Name of item
	items_menu_3[0].updateScreen_up = p_print_rows_on_oled_if_up;
	items_menu_3[0].updateScreen_down = p_print_rows_on_oled_if_down;
	items_menu_3[0].makeAction = p_do_it_function_menu_3;

	items_menu_3[1].up = &items_menu_3[0];
	items_menu_3[1].down = 0;
	items_menu_3[1].child = 0;
	items_menu_3[1].parent = &items[2];
	items_menu_3[1].id = 2;
	items_menu_3[1].name = "EXIT";						// Name of item
	items_menu_3[1].updateScreen_up = p_print_rows_on_oled_if_up;
	items_menu_3[1].updateScreen_down = p_print_rows_on_oled_if_down;
	items_menu_3[1].makeAction = p_return_from_menu;
}

// ----------------------------------------------------------------------------------------
void menu(void)
{
	Menu_Init();									// Init all structures
	print_menu_init();								// Print start menu and scrolingbar
	HAL_Delay(10);

	while(1)
	{
		if(button_processed_status == 1)			// If buttons was pressed
		{

			button_processed_status = 1;
			switch (button_status)
			{
				case BOTTON_UP:
					up();
					break;
				case BUTTON_ENTER:
					enter();
					break;
				case BUTTON_DOWN:
					down();
					break;
			}
			button_status = BOTTON_DOESENT_PRESS;
		}
	}
}
// ----------------------------------------------------------------------------------------
void up(void)
{
	if (currentItem->up)
	{
	    currentItem = currentItem->up;
	    if (currentItem->updateScreen_up )
	    {
	        currentItem->updateScreen_up();
	    }
	}
}
// ----------------------------------------------------------------------------------------
void down(void)
{
	if (currentItem->down)
	{
	    currentItem = currentItem->down;
	    if (currentItem->updateScreen_down )
	    {
	        currentItem->updateScreen_down();
	    }
	}
}
// ----------------------------------------------------------------------------------------
void enter(void)
{
	bool status = true;
	// Якщо є функція "makeAction" тоді виконати її
	if (currentItem->makeAction)
	{
		currentItem->makeAction();
		status = false;
	}
	// Якщо є перехід на  "child" і "makeAction" не була виконана, тоді виконати перехід
	if((currentItem->child) && (status == true))
	{
		currentItem = currentItem->child;
		print_menu_items();
	}
}
// ----------------------------------------------------------------------------------------

// ----------------------------------------------------------------------------------------
/*
This function print scrollbar on right part of OLED.
 */
void scroll_bar(void)
{
	// Work size scrollbar
	uint16_t start_x_scrollbar = 124;
	uint16_t start_y_scrollbar = 17;
	uint16_t active_width = 3;
	uint16_t lenght_all_scrollbar = 48;

	uint8_t menu_items_counter = 1;

	// Знайти скільки емементві в меню. Відповідно до кількості елементів вирахоується довжини скролбару
	// 1. Скопіювати показник на меню в буффер.
	// 2. Піднятися до першого елемента меню.
	// 3. Опускатися вниз до останнього пункту меню і інкрементувати лічильник елементів меню.
	// 4. Використати лічильник пунктів меню для вираховування довжини полоси прокрутки і її координат.

	MenuItem_t * currentItem_buff = currentItem;

	if ((currentItem_buff -> up) != 0)							// Step up if existing up
	{
		do{
			currentItem_buff = currentItem_buff -> up;			// Step up to the top of menu
		}
		while ((currentItem_buff -> up) != 0);					// If the top of item doesen't found
	}

	if ((currentItem_buff -> up) == 0)							// If found top of menu item
	{
		do{
			currentItem_buff = currentItem_buff -> down;
			menu_items_counter++;								// Count how many list on menu
		}
		while ((currentItem_buff -> down) != 0);
	}
	 // Очистити частину керану де є скролбар
	ssd1306FillRect(start_x_scrollbar, start_y_scrollbar, active_width, lenght_all_scrollbar - 2, Black);

	// Вивести подовгастий квадрат на край екрану
	ssd1306_DrawRectangle(start_x_scrollbar - 1, start_y_scrollbar - 1, start_x_scrollbar + active_width, 63, White);
	ssd1306_UpdateScreen();

	 // Print scroling line
	int id_for_line = currentItem -> id;				// Скопіювати порядковий номер меню (Для того щоб взнати на якому пункті меню зараз стоїмо)
	// Print scroling line
	uint16_t line_lenght = (lenght_all_scrollbar/menu_items_counter + 1);					   	// Довжина лінії яка відповідає одному меню
	uint16_t start_lenght = 16 + ((id_for_line - 1)*line_lenght);								// Початок лінії
	// Print active scrollbar part (line)
	ssd1306FillRect(start_x_scrollbar, start_lenght, active_width, line_lenght, White);

