OlegDemk/stm32F103C8_NRF24L01_and_LoRa_E220_900T22D/RX/Core/Src/menu/menu.c
	// Print selected name of menu
	char str[16] = {0};
	strncpy(str, currentItem -> name, 15);
	ssd1306_SetCursor(10, 3);
	ssd1306_WriteString(str,  Font_7x10, White);
	ssd1306_UpdateScreen();
	memset(str, 0, sizeof(str));

	button_status = BOTTON_DOESENT_PRESS;
	block_interrupt_form_up_and_down_buttons = true;
	// waiting for press enter(SW2) button
	do{
		LoRa_RX(true);
	}while (button_status != BUTTON_ENTER);
	LoRa_RX(false);

	block_interrupt_form_up_and_down_buttons = false;

	// Return to first item of current menu
	currentItem = &items_menu_1[0];										// Set global pointer on first menu
	print_menu_items();													// Print items on OLED
}
// ----------------------------------------------------------------------------------------
void lora_tx_mode(void)
{
	clearn_oled();
	print_rectangle_on_head();

	// Print selected name of menu
	char str[16] = {0};
	strncpy(str, currentItem -> name, 15);
	ssd1306_SetCursor(10, 3);
	ssd1306_WriteString(str,  Font_7x10, White);
	ssd1306_UpdateScreen();
	memset(str, 0, sizeof(str));


	button_status = BOTTON_DOESENT_PRESS;
	block_interrupt_form_up_and_down_buttons = true;
	// waiting for press enter(SW2) button
	do{
		LoRa_TX(true);

	}while (button_status != BUTTON_ENTER);
	LoRa_TX(false);

	block_interrupt_form_up_and_down_buttons = false;

	// Return to first item of current menu
	currentItem = &items_menu_1[0];										// Set global pointer on first menu
	print_menu_items();													// Print items on OLED
}
// ----------------------------------------------------------------------------------------
////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////
// NRF FUNCTIONS
void nrf_rx_mode(void)
{
	clearn_oled();
	NRF24_init_RX_mode();
	print_rectangle_on_head();

	// Print selected name of menu
	char str[16] = {0};
	strncpy(str, currentItem -> name, 15);
	ssd1306_SetCursor(10, 3);
	ssd1306_WriteString(str,  Font_7x10, White);
	ssd1306_UpdateScreen();
	memset(str, 0, sizeof(str));

	button_status = BOTTON_DOESENT_PRESS;
	block_interrupt_form_up_and_down_buttons = true;
	// waiting for press enter(SW2) button
	do{
		NRF24L01_Receive();
	}while (button_status != BUTTON_ENTER);

	NRF24_WriteReg(CONFIG, 0x00); 										// STOP work with nrf module  (Power off)
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);				// Turn off GREEN LED
	block_interrupt_form_up_and_down_buttons = false;
	// Return to first item of current menu
	currentItem = &items_menu_2[0];										// Set global pointer on first menu
	print_menu_items();													// Print items on OLED
}
// ----------------------------------------------------------------------------------------
void nrf_tx_mode(void)
{
	clearn_oled();
	NRF24_init_TX_mode();
	print_rectangle_on_head();

	// Print selected name of menu
	char str[16] = {0};
	strncpy(str, currentItem -> name, 15);
	ssd1306_SetCursor(10, 3);
	ssd1306_WriteString(str,  Font_7x10, White);
	ssd1306_UpdateScreen();
	memset(str, 0, sizeof(str));

	button_status = BOTTON_DOESENT_PRESS;
	block_interrupt_form_up_and_down_buttons = true;
	// waiting for press enter(SW2) button
	do{
		NRF24L01_Transmission();
	}while (button_status != BUTTON_ENTER);

	NRF24_WriteReg(CONFIG, 0x00); 										// STOP work with nrf module  (Power off)
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);				// Turn off GREEN LED
	block_interrupt_form_up_and_down_buttons = false;
	// Return to first item of current menu
	currentItem = &items_menu_2[0];										// Set global pointer on first menu
	print_menu_items();													// Print items on OLED
}
// ----------------------------------------------------------------------------------------
////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////
// SENSORS FUNCTIONS











// ----------------------------------------------------------------------------------------
void items_menu_1_set_par_1(void)
{
	clearn_oled();

	// Print selected name of menu
	char str[16] = {0};
	strncpy(str, currentItem -> name, 15);
	ssd1306_SetCursor(10, 3);
	ssd1306_WriteString(str,  Font_7x10, White);
	ssd1306_UpdateScreen();
	memset(str, 0, sizeof(str));

	strncpy(str, "Set parametr 1", sizeof(str));
	ssd1306_SetCursor(0, first_menu_row);
	ssd1306_WriteString(str,  Font_7x10, White);
	ssd1306_UpdateScreen();

	button_status = BOTTON_DOESENT_PRESS;
	block_interrupt_form_up_and_down_buttons = true;
	do{
		// Doing settings <<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<

	}while (button_status != BUTTON_ENTER);
	block_interrupt_form_up_and_down_buttons = false;

	// Return to first item of current menu
	currentItem = &items_menu_1[0];										// Set global pointer on first menu
	print_menu_items();													// Print items on OLED
}
// ----------------------------------------------------------------------------------------
void items_menu_1_set_par_2(void)
{
	clearn_oled();

	// Print selected name of menu
	char str[16] = {0};
	strncpy(str, currentItem -> name, 15);
	ssd1306_SetCursor(10, 3);
	ssd1306_WriteString(str,  Font_7x10, White);
	ssd1306_UpdateScreen();
	memset(str, 0, sizeof(str));

	strncpy(str, "Set parametr 2", sizeof(str));
	ssd1306_SetCursor(0, first_menu_row);
	ssd1306_WriteString(str,  Font_7x10, White);
	ssd1306_UpdateScreen();

	button_status = BOTTON_DOESENT_PRESS;
	block_interrupt_form_up_and_down_buttons = true;
	do{
		// Doing settings <<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
	}while (button_status != BUTTON_ENTER);
	block_interrupt_form_up_and_down_buttons = false;

	// Return to first item of current menu
	currentItem = &items_menu_1[0];										// Set global pointer on first menu
	print_menu_items();													// Print items on OLED
}
// ----------------------------------------------------------------------------------------
////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////
//void do_it_function_menu_2(void)
//{
//	clearn_oled();
//
//	// Print selected name of menu
//	char str[16] = {0};
//	strncpy(str, currentItem -> name, 15);
//	ssd1306_SetCursor(10, 3);
//	ssd1306_WriteString(str,  Font_7x10, White);
//	ssd1306_UpdateScreen();
//	memset(str, 0, sizeof(str));
//
//	strncpy(str, "Doing something 2", sizeof(str));
//	ssd1306_SetCursor(0, first_menu_row);
//	ssd1306_WriteString(str,  Font_7x10, White);
//	ssd1306_UpdateScreen();
//
//	button_status = BOTTON_DOESENT_PRESS;
//	block_interrupt_form_up_and_down_buttons = true;
//	do{
//		HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET);
//		HAL_Delay(50);
//		HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
//		HAL_Delay(50);
//	}while (button_status != BUTTON_ENTER);
//	block_interrupt_form_up_and_down_buttons = false;
//
//	// Return to first item of current menu
//	currentItem = &items_menu_2[0];										// Set global pointer on first menu
//	print_menu_items();													// Print items on OLED
//}
// ----------------------------------------------------------------------------------------
void items_menu_2_set_par_1(void)
{
	clearn_oled();

